{
  "basics": {
    "name": "Cassio Cardoso",
    "label": "Front-end Engineer",
	  "picture": "",
	  "email": "caugusto.cardoso@gmail.com",
    "phone": "",
		"url": "https://cassiocardoso.me",
		"summary": "I’m a self-motivated front-end engineer with over eight years of experience. Throughout my career I had the chance to work on projects of all sizes, from small internal tools to applications that are used by millions of people each month, I always strive to deliver the best user experience to the customer with a reliable, resilient and highly available solution.",
    "location": {

			"city": "Berlin",
			"countryCode": "DE",
			"region": "Berlin"
		},
		"profiles": [
      {
        "network": "LinkedIn",
        "username": "cassiocardoso",
        "url": "https://br.linkedin.com/in/cassiocardoso"
      },
      {
        "network": "GitHub",
        "username": "cassiocardoso",
        "url": "https://github.com/cassiocardoso"
      },
      {
        "network": "Stack Overflow",
        "username": "cassiocardoso",
        "url": "http://stackoverflow.com/users/3816479/cassiocardoso"
      },
      {
        "network": "npm",
        "username": "cassiocardoso07",
        "url": "https://www.npmjs.com/~cassiocardoso07"
      },
      {
        "network": "Twitter",
        "username": "cassiocardoso",
        "url": "https://twitter.com/cassiocardoso"
      },
			{
				"network": "Facebook",
				"username": "cassiocardoso01",
				"url": "https://www.facebook.com/cassiocardoso01"
			},
      {
				"network": "Instagram",
				"username": "cassiocardoso",
				"url": "https://www.instagram.com/cassiocardoso/"
			}
		]
	},
	"work": [
    {
      "name": "Omio (formerly GoEuro)",
      "location": "Berlin, Germany",
      "description": "Omio takes a unique approach to travel. Our pioneering platform allows you to find the fastest, cheapest and best travel options by train, bus and flight to thousands of cities, towns and villages across Europe, the United States and Canada.",
      "position": "Software Engineer",
      "url": "https://omio.com",
      "startDate": "2018-11-12",
      "endDate": "current",
      "summary": "Working in the acquisition tribe where our main goal is to get more users in the platform and convert them into customers by providing the best experience tailored to their intent",
      "highlights": [
        "Created new components tailored to the user intent for the landing pages",
        "Developed an MVP of the AMP project to speed-up the landing pages",
        "Implemented a performance metrics and checks to focusing on optimizing performance"
      ]
    },
    {
      "name": "QuintoAndar",
      "location": "São Paulo, Brazil",
      "description": "QuintoAndar uses technology and design to make the renting experience pleasant for both the tenants and landlords.",
      "position": "Software Engineer",
      "url": "https://quintoandar.com.br",
      "startDate": "2017-11-06",
      "endDate": "2018-10-29",
      "summary": "Worked in the real estate agents support squad developing a new PWA to enable them to organize their daily activities",
      "highlights": [
        "Developed a new PWA for the real estate agents",
        "Created and maintained performance budgets for the app"
      ]
    },
    {
      "name": "AMARO",
      "location": "São Paulo, Brazil",
      "description": "AMARO is a DNVB (digital native vertical brand that uses bleeding-edge technology to become the biggest case of omni-channel experiences in Brazil.",
      "position": "Lead Front-end Developer",
      "url": "https://amaro.com",
      "startDate": "2016-07-01",
      "endDate": "2017-10-31",
      "summary": "Lead the development of the new front-end application for the e-commerce platform which included a new design, new features and optimizations focused on performance and SEO improvements",
      "highlights": [
        "Led the development of the new front-end application using a new tech stack",
        "Refined and delivered new functionality to the customers",
        "Organized the front-end team tasks in an agile way"
      ]
    },
		{
      "name": "AMARO",
      "location": "São Paulo, Brazil",
      "description": "AMARO is a DNVB (digital native vertical brand that uses bleeding-edge technology to become the biggest case of omni-channel experiences in Brazil.",
      "position": "Lead Front-end Developer",
      "url": "https://amaro.com",
			"startDate": "2014-07-01",
			"endDate": "2016-06-30",
			"summary": "Develop and maintain the front-end for the e-commerce application, gather requirements, build layouts, optimize the performance and SEO rankings.",
			"highlights": [
        "Joined the company as employee #30",
				"Built the entire front-end application for the in-house e-commerce platform",
        "Created an internal UI library to be used across all the front-end apps"
			]
		},
    {
			"company": "INPE",
			"position": "Web Developer",
			"website": "http://www.inpe.br",
			"startDate": "2009-03-01",
			"endDate": "2014-04-30",
			"summary": "Worked as a web developer in the space weather program, developed its web portal and several integrations with equipments collecting data across the country. Built visualization tools for these data. ",
			"highlights": [
				"Developed the website for the Space Weather program.",
        "Developed systems to store and visualize data collected by different equipments across the country",
        "Build an online system to allow space weather researchers to publish a daily bulletin with a summary of information from the related fields of study.",
        "Build hot-sites for biannual workshops organized by the Space Weather program."
			]
		}
	],
  "volunteer": [
    {
			"organization": "Taubaté Big Donkeys",
			"position": "President & Head Coach",
			"website": "https://facebook.com/bigdonkeys",
			"startDate": "2010-01-01",
			"endDate": "2014-12-31",
			"summary": "Taubaté Big Donkeys is a non-profit sports organization based in Taubaté, São Paulo. The organization has an adult male flag-football team which plays the state championship in two modalities: 5x5 and 8x8. It had a junior and a female team during 2011-2013. It is always organizing events to help other NPO in the city and increase awareness about football.",
			"highlights": [
        "Managed the administrative and finance departments of the organization from 2011 to 2013.",
				"Coached the adult team from 2010 to 2014.",
        "Coached the junior and female team in 2013.",
        "Organized around 4 football games in Taubaté city form 2011 to 2014.",
        "Champion of Paraíba Valley Bowl in 2012",
        "Runner up of Paraíba Valley Bowl in 2013",
        "Third place in brazilian national flag championship in 2013",
        "Runner-up of São Paulo state flag championship in 2013",
        "Runner-up of São Paulo state flag championship in 2014"
			]
		}
  ],
  "education": [
    {
      "institution": "UNIVAP - Universidade do Vale do Paraíba",
      "area": "Computer Engineering",
      "studyType": "Bachelor",
      "startDate": "2008-02-01",
      "endDate": "2014-12-01",
      "gpa": "",
      "courses": []
    }
  ],
	"projects": [
    {
			"organization": "FEMUG-VP (Front-end meetup group - Vale do Paraíba)",
			"position": "Co-founder",
			"website": "http://sp.femug.com",
      "area": "Web development",
			"startDate": "2014-02-01",
			"endDate": "current",
			"summary": "I helped to organize the Front-End developers community in Vale do Paraíba. Contacted BrazilJS, to open a new group in the region and merged the idea with other professionals with an existing group.",
			"highlights": [
        "We organize monthly meetups to talk about front-end development, resources, worklfow, techniques and everything between these topics."
			]
		}
  ],
	"awards": [],
	"publications": [],
	"skills": [
		{
			"name": "Front-end Development",
			"level": "Master",
			"keywords": [
				"HTML",
				"CSS",
				"Javascript",
        "React",
        "Redux",
        "Node.js",
        "TypeScript"
			]
		},
    {
      "name": "Soft skills",
      "level": "Master",
      "keywords": [
        "Ownership",
        "Hands-on",
        "Eager to learn",
        "Self-motivated",
        "Project management",
        "Leadership"
      ]
    }
	],
	"languages": [
		{
			"language": "Portuguese",
			"fluency": "Native speaker"
		},
    {
			"language": "English",
			"fluency": "Professional fluency"
		},
    {
			"language": "Spanish",
			"fluency": "Limited conversational skills (B1)"
		},
    {
			"language": "German",
			"fluency": "Limited conversational skills (A1)"
		}
	],
	"interests": [
		{
			"name": "Sports",
			"keywords": [
				"Soccer",
				"Football",
        "Volleyball",
        "Tennis",
        "Ping pong"
			]
		},
    {
			"name": "Games",
			"keywords": [
				"Board Games",
				"Video Games"
			]
		}
	],
	"references": [
    {
      "name": "Rubens Gatto",
      "reference": "Orientei o Cássio como bolsista-PCI no INPE durante o desenvolvimento do portal do programa EMBRACE - Estudo e Monitoramento Brasileiro de Clima Espacial. Desempenhou as atividades atribuídas a ele com competência e criatividade, sendo seu trabalho neste projeto considerado um dos melhores sob o programa PCI do INPE."
    },
    {
      "name": "Walter Gargarela",
      "reference": "Cassio is a very committed person and professional, always ready for what is necessary and extremely focused on the quality of their services, using the most modern technologiesin an appropriate way, into the project that participated, reaching and developing solutions of the highest level . I have a great pleased to have you as friend after years of working together, proud to see their professional growth, recommending it to anyone."
    }
  ],
	"meta": {
		"url": "https://raw.githubusercontent.com/cassiocardoso/resume/master/resume.json",
    "version": "1.0.0",
    "lastModified": "2020-04-04T15:00:00"
  }
}
